"""Products=[
(1, {"название": "компьютер", "цена": 20000, "количество": 5, "eд": "шт."}),
(2, {"название": "принтер", "цена": 6000, "количество": 2, "eд": "шт."}), 
(3, {"название": "сканер", "цена": 2000, "количество": 7, "eд": "шт."})
]
"""
lst = []
i = 1
while True:
    name = input("Введите название товара : ")
    price = float(input("Введите цену товара : "))
    cnt = int(input("Введите количество товара : "))
    unit = input("Введите eдиницы измерения товара : ")
    d = {}
    d["название"] = name
    d["цена"] = price
    d["количество"] = cnt
    d["eд"] = unit
    l = []
    l.append(i)
    l.append(d)
    lst.append(tuple(l))
    i += 1
    if input("Введите XXX для завершения : ") == "XXX":
        break
print(lst)

d2 = {}
d2["название"] = []
d2["цена"] = []
d2["количество"] = []
d2["eд"] = []
for l in lst:
    dct = l[1]
    if dct["название"] not in d2["название"]:
        d2["название"].append(dct["название"])
    if dct["цена"] not in d2["цена"]:
        d2["цена"].append(dct["цена"])
    if dct["количество"] not in d2["количество"]:
        d2["количество"].append(dct["количество"])
    if dct["eд"] not in d2["eд"]:
        d2["eд"].append(dct["eд"])
print("*" * 45)
print(d2)
